ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2040/ZuluIDE_platform.cpp
    logmsg("Platform: ", g_platform_name);
    logmsg("FW Version: ", g_log_firmwareversion);

    logmsg("DIP switch settings: cablesel ", (int)g_dip_cable_sel, ", drive_id ", (int)g_dip_drive_id, " debug log ", (int)dbglog);

    g_log_debug = dbglog;


    // Get flash chip size
    uint8_t cmd_read_jedec_id[4] = {0x9f, 0, 0, 0};
    uint8_t response_jedec[4] = {0};
    flash_do_cmd(cmd_read_jedec_id, response_jedec, 4);
    g_flash_chip_size = (1 << response_jedec[3]);
    logmsg("Flash chip size: ", (int)(g_flash_chip_size / 1024), " kB");

    // Get flash chip unique ID
    // (flash_get_unique_id() from RP2040 libs didn't work for some reason)
    uint8_t cmd_read_uniq_id[13] = {0x4B};
    uint8_t response_uniq_id[13] = {0};
    flash_do_cmd(cmd_read_uniq_id, response_uniq_id, 13);
    memcpy(&g_flash_unique_id, response_uniq_id + 5, 8);
    logmsg("Flash unique ID: ", g_flash_unique_id);

    // SD card pins
    // Card is used in SDIO mode, rp2040_sdio.cpp will redirect these to PIO1
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(SDIO_CLK,       GPIO_FUNC_SIO, true, false, true,  true, true);
    gpio_conf(SDIO_CMD,       GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D0,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D1,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D2,        GPIO_FUNC_SIO, true, false, false, true, true);
    gpio_conf(SDIO_D3,        GPIO_FUNC_SIO, true, false, false, true, true);

    // I2C pins
    //        pin                 function       pup   pdown  out    state fast
    gpio_conf(GPIO_I2C_SCL,       GPIO_FUNC_I2C, true, false, false,  true, true);
    gpio_conf(GPIO_I2C_SDA,       GPIO_FUNC_I2C, true, false, false,  true, true);

    // FPGA bus
    // Signals will be switched between SPI/PIO by rp2040_fpga.cpp, but pull-ups are configured here.
    //        pin             function       pup   pdown  out    state fast
    gpio_conf(FPGA_CLK,       GPIO_FUNC_GPCK,false,false, true,  false, true);
    gpio_conf(FPGA_CRESET,    GPIO_FUNC_SIO, false,false, true,  false, false);
    gpio_conf(FPGA_CDONE,     GPIO_FUNC_SIO, true, false, false, false, false);
    gpio_conf(FPGA_SS,        GPIO_FUNC_SIO, true, false, true,  true,  false);
    gpio_conf(FPGA_QSPI_SCK,  GPIO_FUNC_SIO, false,false, true,  false, true);
    gpio_conf(FPGA_QSPI_D0,   GPIO_FUNC_SIO, true, false, true,  false, true);
    gpio_conf(FPGA_QSPI_D1,   GPIO_FUNC_SIO, true, false, true,  false, true);
    gpio_conf(FPGA_QSPI_D2,   GPIO_FUNC_SIO, true, false, true,  false, true);
    gpio_conf(FPGA_QSPI_D3,   GPIO_FUNC_SIO, true, false, true,  false, true);

    // IDE initialization status signals
    gpio_conf(IDE_CSEL_IN,    GPIO_FUNC_SIO, false,false, false, false, false);
    gpio_conf(IDE_PDIAG_IN,   GPIO_FUNC_SIO, false,false, false, false, false);
    gpio_conf(IDE_DASP_IN,    GPIO_FUNC_SIO, false,false, false, false, false);

    // Status LED
    gpio_conf(STATUS_LED,     GPIO_FUNC_SIO, false,false, true,  false, false);
}

// late_init() only runs in main application
void platform_late_init()
{
    dbgmsg("Loading FPGA bitstream");
    if (fpga_init())
    {
        logmsg("FPGA initialization succeeded");
    }
    else
    {
        logmsg("ERROR: FPGA initialization failed");
    }
#ifdef ENABLE_AUDIO_OUTPUT
    logmsg("I2S audio to expansion header enabled");
    reclock_for_audio();
    logmsg("-- System clock is set to ", (int) clock_get_hz(clk_sys),  "Hz");
    // one-time control setup for DMA channels and second core
    audio_init();
#endif
    platform_check_for_controller();
    USB.begin();
}

void platform_poll_input() {
  g_rotary_input.Poll();
}

void platform_write_led(bool state)
{
    if (g_led_disabled || g_led_blinking) return;

    gpio_put(STATUS_LED, state);
}

void platform_set_blink_status(bool status)
{
    g_led_blinking = status;
}

void platform_write_led_override(bool state)
{
    if (g_led_disabled) return;

    gpio_put(STATUS_LED, state);

}
void platform_disable_led(void)
{   
    g_led_disabled = true;
    logmsg("Disabling status LED");
}

void platform_init_eject_button(uint8_t eject_button)
{
    if (eject_button & 1)
    {
        //        pin                   function       pup   pdown  out    state fast
        gpio_conf(GPIO_EJECT_BTN_1_PIN, GPIO_FUNC_SIO, true, false, false, true, false);
        g_eject_buttons |= 1;
    }

    if (eject_button & 2)
    {
        gpio_conf(GPIO_EJECT_BTN_2_PIN, GPIO_FUNC_SIO, true, false, false, true, false);
        g_eject_buttons |= 2;
    }
}

uint8_t platform_get_buttons()
{
    uint8_t buttons = 0;

    if ((g_eject_buttons & 1) && (!gpio_get(GPIO_EJECT_BTN_1_PIN))) 
        buttons |= 1;
    if ((g_eject_buttons & 2) && !gpio_get(GPIO_EJECT_BTN_2_PIN)) 
        buttons |= 2;

    // Simple debouncing logic: handle button releases after 100 ms delay.
    static uint32_t debounce;
    static uint8_t buttons_debounced = 0;

    if (buttons != 0)
    {
        buttons_debounced = buttons;
        debounce = millis();
    }
    else if ((uint32_t)(millis() - debounce) > 100)
    {
        buttons_debounced = 0;
    }

    return buttons_debounced;
}

int platform_get_device_id(void)
{
    if (g_dip_cable_sel)
    {
        if (gpio_get(IDE_CSEL_IN))
            return 1;    // CSEL wire has been cut, secondary device
        else
            return 0;    // CSEL wire grounded, primary device
    }
    else
    {
        if (g_dip_drive_id)
            return 1;    // PRI/SEC switch on, secondary device
        else
            return 0;    // PRI/SEC switch off, primary device
    }
}

/****************************************/
/* Direct serial access                 */
/************************************** */
bool platform_serial_ready()
{
    return Serial.availableForWrite();
}

size_t platform_serial_write(uint8_t *buf, size_t len)
{
    return Serial.write(buf, len);
}


