ZuluIDE/ZuluIDE-firmware/lib/ZuluIDE_platform_RP2040/ZuluIDE_platform.cpp
        license_log_done = true;
    }

    // update settings for the controller board the first time SD is read
    if (!updated_controller_board && g_sdcard_present && g_rotary_input.GetDeviceExists())
    {
        uint8_t ticks = ini_getl("UI", "rotary_encoder_ticks", 1, CONFIGFILE);
        g_rotary_input.SetTicks(ticks);
        updated_controller_board = true;
    }

    // Monitor supply voltage and process USB events
    adc_poll();
    usb_log_poll();
    usb_command_poll();
    if (only_from_main)
        g_I2CServerImageRequestPipe.ProcessUpdates();

#ifdef ENABLE_AUDIO_OUTPUT
    static bool update_volume = false;
    if (!update_volume && g_sdcard_present)
    {
        uint8_t max_volume = (uint8_t) ini_getl("IDE", "max_volume", 100, CONFIGFILE);
        if (max_volume > 100)
        {
            max_volume = 100;
            logmsg("The setting max_volume was set higher than 100, setting to 100 from ", (int) max_volume);
        }
        audio_set_max_volume(max_volume);
        update_volume = true;
        logmsg("Max volume set to ", (int) max_volume, "/100");
    }
    audio_poll();
#endif // ENABLE_AUDIO_OUTPUT
}

/*****************************************/
/* Flash reprogramming from bootloader   */
/*****************************************/

#ifdef PLATFORM_BOOTLOADER_SIZE

extern uint32_t __real_vectors_start;
extern uint32_t __StackTop;
static volatile void *g_bootloader_exit_req;

__attribute__((section(".time_critical.platform_rewrite_flash_page")))
bool platform_rewrite_flash_page(uint32_t offset, uint8_t buffer[PLATFORM_FLASH_PAGE_SIZE])
{
    if (offset == PLATFORM_BOOTLOADER_SIZE)
    {
        if (buffer[3] != 0x20 || buffer[7] != 0x10)
        {
            logmsg("Invalid firmware file, starts with: ", bytearray(buffer, 16));
            return false;
        }
    }

    if (nvic_hw->iser & 1 << 14)
    {
        logmsg("Disabling USB during firmware flashing");
        nvic_hw->icer = 1 << 14;
        usb_hw->main_ctrl = 0;
    }

    dbgmsg("Writing flash at offset ", offset, " data ", bytearray(buffer, 4));
    assert(offset % PLATFORM_FLASH_PAGE_SIZE == 0);
    assert(offset >= PLATFORM_BOOTLOADER_SIZE);

    // Avoid any mbed timer interrupts triggering during the flashing.
    uint32_t saved_irq = save_and_disable_interrupts();

    // For some reason any code executed after flashing crashes
    // unless we disable the XIP cache.
    // Not sure why this happens, as flash_range_program() is flushing
    // the cache correctly.
    // The cache is now enabled from bootloader start until it starts
    // flashing, and again after reset to main firmware.
    xip_ctrl_hw->ctrl = 0;

    flash_range_erase(offset, PLATFORM_FLASH_PAGE_SIZE);
    flash_range_program(offset, buffer, PLATFORM_FLASH_PAGE_SIZE);

    uint32_t *buf32 = (uint32_t*)buffer;
    uint32_t num_words = PLATFORM_FLASH_PAGE_SIZE / 4;
    for (int i = 0; i < num_words; i++)
    {
        uint32_t expected = buf32[i];
        uint32_t actual = *(volatile uint32_t*)(XIP_NOCACHE_BASE + offset + i * 4);

        if (actual != expected)
        {
            logmsg("Flash verify failed at offset ", offset + i * 4, " got ", actual, " expected ", expected);
            return false;
        }
    }

    restore_interrupts(saved_irq);

    return true;
}

void platform_boot_to_main_firmware()
{
    // To ensure that the system state is reset properly, we perform
    // a SYSRESETREQ and jump straight from the reset vector to main application.
    g_bootloader_exit_req = &g_bootloader_exit_req;
    scb_hw->aircr = 0x05FA0004;
    while(1);
}

void btldr_reset_handler()
{
    uint32_t* application_base = &__real_vectors_start;
    if (g_bootloader_exit_req == &g_bootloader_exit_req)
    {
        // Boot to main application
        application_base = (uint32_t*)(XIP_BASE + PLATFORM_BOOTLOADER_SIZE);
    }

    scb_hw->vtor = (uint32_t)application_base;
    __asm__(
        "msr msp, %0\n\t"
        "bx %1" : : "r" (application_base[0]),
                    "r" (application_base[1]) : "memory");
}

// Replace the reset handler when building the bootloader
// The rp2040_btldr.ld places real vector table at an offset.
__attribute__((section(".btldr_vectors")))
const void * btldr_vectors[2] = {&__StackTop, (void*)&btldr_reset_handler};

#endif


/********************************/
/* 2nd core code                */
/********************************/
void zuluide_setup(void)
{
   if (!platform_check_for_controller())
   {
     rp2040.idleOtherCore();
     multicore_reset_core1();
     dbgmsg("No Zulu Control board or I2C server found, disabling 2nd core");
   }
}

void zuluide_setup1(void)
{

}

/***
    Execution actions on the UI core.
**/
void zuluide_main_loop1(void)
{
    platform_poll_input();

    if (uiStatusController)
    {
        // Process status update, if any exist.
        if (!uiStatusController->ProcessUpdate()) {
            // If no updates happend, refresh the display (enables animation)
            display.Refresh();
        }
        g_controllerImageResponsePipe->ProcessUpdates();
        g_I2cServer.Poll();
    }
}

mutex_t* platform_get_log_mutex() {
  return &logMutex;
}
